app/controllers/pages_controller.rb

  def home
	@var = Variable.new(params[:var])
      @var.save
---
INSERT INTO "variables" ("created_at", "name", "updated_at", "value") VALUES (?, ?, ?, ?)  [["created_at", Sun, 29 Apr 2012 22:35:44 UTC +00:00], ["name", "bob"], ["updated_at", Sun, 29 Apr 2012 22:35:44 UTC +00:00], ["value", "marley"]]